<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>au.edu.nsw.chevalier.it.munki.Caffeine</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>http://download.lightheadsw.com/download.php?software=caffeine</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>tools/lighthead/caffeine</string>
		<key>NAME</key>
		<string>Caffeine</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Useful Tools</string>
			<key>developer</key>
			<string>Lighthead Software</string>
			<key>icon_name</key>
			<string>Caffeine.png</string>
			<key>description</key>
			<string>Caffeine is a tiny program that puts an icon in the right side of your menu bar. Click it to prevent your Mac from automatically going to sleep, dimming the screen or starting screen savers. Click it again to go back. Right-click (or ⌘-click) the icon to show the menu.</string>
			<key>display_name</key>
			<string>Caffeine</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>uninstallable</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.keeleysam.recipes.Caffeine.munki</string>
</dict>
</plist>
