<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads and imports version 2 of the Munki tools.
As long as there is not yet an official release of version 2, DOWNLOAD_URL
simply points to that of the latest auto-build:
https://munkibuilds.org/munkitools2-latest.pkg</string>
    <key>Identifier</key>
	<string>au.edu.nsw.chevalier.it.munki.Munkitools2</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>munkitools2</string>
        <key>DOWNLOAD_URL</key>
        <string>https://munkibuilds.org/munkitools2-latest.pkg</string>
        <key>MUNKI_CATALOG</key>
        <string>testing</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>core/munki</string>
		<key>MUNKITOOLS_CATEGORY</key>
		<string>Core Management Tools</string>
		<key>MUNKITOOLS_DEVELOPER</key>
		<string>Munki</string>
        <!--  -->
        <key>MUNKITOOLS_CORE_NAME</key>
        <string>Munkitools_Core</string>
        <key>MUNKITOOLS_CORE_DISPLAYNAME</key>
        <string>Managed Software Center - Core</string>
        <key>MUNKITOOLS_CORE_DESCRIPTION</key>
        <string>Managed Software Center Core Command-line tools.</string>
		<key>MUNKITOOLS_CORE_ICON</key>
		<string>MunkitoolsCore.png</string>
        <!--  -->
        <key>MUNKITOOLS_ADMIN_NAME</key>
        <string>Munkitools_Admin</string>
        <key>MUNKITOOLS_ADMIN_DISPLAYNAME</key>
        <string>Managed Software Center - Admin</string>
        <key>MUNKITOOLS_ADMIN_DESCRIPTION</key>
        <string>Managed Software Center Command-line Admin tools.</string>
		<key>MUNKITOOLS_ADMIN_ICON</key>
		<string>MunkitoolsAdmin.png</string>
		        <!--  -->
        <key>MUNKITOOLS_APP_NAME</key>
        <string>Munkitools_App</string>
        <key>MUNKITOOLS_APP_DISPLAYNAME</key>
        <string>Managed Software Center - App</string>
        <key>MUNKITOOLS_APP_DESCRIPTION</key>
        <string>Managed Software Center Application.</string>
		<key>MUNKITOOLS_APP_ICON</key>
		<string>MunkitoolsApp.png</string>
        <!--  -->
        <key>MUNKITOOLS_LAUNCHD_NAME</key>
        <string>Munkitools_Launchd</string>
        <key>MUNKITOOLS_LAUNCHD_DISPLAYNAME</key>
        <string>Managed Software Center - LaunchD</string>
        <key>MUNKITOOLS_LAUNCHD_DESCRIPTION</key>
        <string>Managed Software Center Configuration files.</string>
		<key>MUNKITOOLS_LAUNCHD_ICON</key>
		<string>MunkitoolsLaunchd.png</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.4</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/repack</string>
                <key>pkgdirs</key>
                <dict/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unpack/munkitools_core*</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgPacker</string>
            <key>Arguments</key>
            <dict>
                <key>source_flatpkg_dir</key>
                <string>%found_filename%</string>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/repack/munkitools_core.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unpack/munkitools_admin*</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgPacker</string>
            <key>Arguments</key>
            <dict>
                <key>source_flatpkg_dir</key>
                <string>%found_filename%</string>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/repack/munkitools_admin.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unpack/munkitools_app*</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgPacker</string>
            <key>Arguments</key>
            <dict>
                <key>source_flatpkg_dir</key>
                <string>%found_filename%</string>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/repack/munkitools_app.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Arguments</key>
            <dict>
                <key>pattern</key>
                <string>%RECIPE_CACHE_DIR%/unpack/munkitools_launchd*</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FlatPkgPacker</string>
            <key>Arguments</key>
            <dict>
                <key>source_flatpkg_dir</key>
                <string>%found_filename%</string>
                <key>destination_pkg</key>
                <string>%RECIPE_CACHE_DIR%/repack/munkitools_launchd.pkg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/repack/munkitools_core.pkg</string>
                <key>pkginfo</key>
                <dict>
                    <key>catalogs</key>
                    <array>
                        <string>%MUNKI_CATALOG%</string>
                    </array>
                    <key>description</key>
                    <string>%MUNKITOOLS_CORE_DESCRIPTION%</string>
                    <key>display_name</key>
                    <string>%MUNKITOOLS_CORE_DISPLAYNAME%</string>
                    <key>name</key>
                    <string>%MUNKITOOLS_CORE_NAME%</string>
					<key>category</key>
					<string>%MUNKITOOLS_CATEGORY%</string>
					<key>developer</key>
					<string>%MUNKITOOLS_DEVELOPER%</string>
					<key>icon_name</key>
					<string>%MUNKITOOLS_CORE_ICON%</string>
                    <key>requires</key>
                    <array>
                        <string>%MUNKITOOLS_LAUNCHD_NAME%</string>
                    </array>
                    <key>unattended_install</key>
                    <true/>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/repack/munkitools_admin.pkg</string>
                <key>pkginfo</key>
                <dict>
                    <key>catalogs</key>
                    <array>
                        <string>%MUNKI_CATALOG%</string>
                    </array>
                    <key>description</key>
                    <string>%MUNKITOOLS_ADMIN_DESCRIPTION%</string>
                    <key>display_name</key>
                    <string>%MUNKITOOLS_ADMIN_DISPLAYNAME%</string>
                    <key>name</key>
                    <string>%MUNKITOOLS_ADMIN_NAME%</string>
					<key>category</key>
					<string>%MUNKITOOLS_CATEGORY%</string>
					<key>developer</key>
					<string>%MUNKITOOLS_DEVELOPER%</string>
					<key>icon_name</key>
					<string>%MUNKITOOLS_ADMIN_ICON%</string>
                    <key>unattended_install</key>
                    <true/>
                    <key>update_for</key>
                    <array>
                        <string>%MUNKITOOLS_CORE_NAME%</string>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/repack/munkitools_app.pkg</string>
                <key>pkginfo</key>
                <dict>
                    <key>catalogs</key>
                    <array>
                        <string>%MUNKI_CATALOG%</string>
                    </array>
                    <key>description</key>
                    <string>%MUNKITOOLS_APP_DESCRIPTION%</string>
                    <key>display_name</key>
                    <string>%MUNKITOOLS_APP_DISPLAYNAME%</string>
                    <key>name</key>
                    <string>%MUNKITOOLS_APP_NAME%</string>
					<key>category</key>
					<string>%MUNKITOOLS_CATEGORY%</string>
					<key>developer</key>
					<string>%MUNKITOOLS_DEVELOPER%</string>
					<key>icon_name</key>
					<string>%MUNKITOOLS_APP_ICON%</string>
                    <key>requires</key>
                    <array>
                        <string>%MUNKITOOLS_CORE_NAME%</string>
                        <string>%MUNKITOOLS_LAUNCHD_NAME%</string>
                    </array>
                    <key>unattended_install</key>
                    <true/>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/repack/munkitools_launchd.pkg</string>
                <key>pkginfo</key>
                <dict>
                    <key>catalogs</key>
                    <array>
                        <string>%MUNKI_CATALOG%</string>
                    </array>
                    <key>description</key>
                    <string>%MUNKITOOLS_LAUNCHD_DESCRIPTION%</string>
                    <key>display_name</key>
                    <string>%MUNKITOOLS_LAUNCHD_DISPLAYNAME%</string>
                    <key>name</key>
                    <string>%MUNKITOOLS_LAUNCHD_NAME%</string>
					<key>category</key>
					<string>%MUNKITOOLS_CATEGORY%</string>
					<key>developer</key>
					<string>%MUNKITOOLS_DEVELOPER%</string>
					<key>icon_name</key>
					<string>%MUNKITOOLS_LAUNCHD_ICON%</string>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
