<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Identifier</key>
	<string>au.edu.nsw.chevalier.it.munki.TextMate2</string>
	<key>Input</key>
	<dict>
		<key>BRANCH</key>
		<string>release</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>development/github/textmate</string>
		<key>NAME</key>
		<string>TextMate2</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Development Tools</string>
			<key>developer</key>
			<string>GitHub, Inc.</string>
			<key>icon_name</key>
			<string>TextMate2.png</string>
			<key>description</key>
			<string>TextMate brings Apple's approach to operating systems into the world of text editors. By bridging UNIX underpinnings and GUI, TextMate cherry-picks the best of both worlds to the benefit of expert scripters and novice users alike.</string>
			<key>display_name</key>
			<string>TextMate 2</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>postinstall_script</key>
			<string>#!/bin/sh
[ -d /usr/local/bin ] || mkdir -p /usr/local/bin
/bin/cp -f -p /Applications/TextMate.app/Contents/Resources/mate /usr/local/bin/mate
</string>
			<key>postuninstall_script</key>
			<string>#!/bin/sh
[ -e /usr/local/bin/mate ] &amp;&amp; rm -f /usr/local/bin/mate
</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>uninstallable</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.munki.TextMate2</string>
</dict>
</plist>
